[
    {
        "title": "ESACLM iPhone 11 Case, iPhone 11 Pro Leather Phone Case with 360 Degree Rotation Finger Ring Shockproof Case with Card Slot for iPhone 11/11Pro/11 Pro Max/XR,Red,iPhone11",
        "rating": "Previous page",
        "price": "$28.99",
        "colour": "Red",
        "description": [
            "",
            "",
            "Make sure this fits",
            "",
            "by entering your model number.",
            "",
            "",
            "1. GENUINE LEATHER: ESACLM iPhone 11 leather case were purely handmade of Leather. The hand feeling of the premium leather is top-grade. Each product you receive is unique",
            "2. Exact Fit: Slim,thin and lightweight case is designed for iPhone 11, Compatible with most 3rd-party screen protectors and other iPhone 11 accessories",
            "3. Full Degree Rotation Ring: The ring is designed as 180 & 360 degree rotating that beats all the other ring holder cases. Ring holder offers extra grip that reduces the chances of dropping your phone and break it",
            "4. High-Grade Quality: Soft TPU bumper frame guards the phone securely while super easy to put on and remove; Scratch resistant back cover displays the true color of your iPhone 11",
            "5. Precise Cutouts: Highly responsive button covers and precise port cutouts ensure quick access and feedback.Provides you one-hand comfortable holding and operation"
        ],
        "reviews": [],
        "brand": "ESACLM",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/61osL%2BGIxbL._AC_SL1001_.jpg"
        ],
        "website": "Amazon",
        "url": "https://www.amazon.com/ESACLM-Leather-Rotation-Shockproof-iPhone11/dp/B083DCM1V6/ref=sr_1_12?dchild=1&keywords=%22iphone11%22&qid=1587656375&sr=8-12"
    },
    {
        "title": "I'm Trash Forky for iPhone11/11Pro/Pro Max Case Phone Cover Protective Case Anti-Scratch Shock-Absorption TPU Black I-Phone 11 Pro max",
        "rating": "Previous page",
        "price": "$10.00",
        "colour": "I-Phone 11 Pro max",
        "description": [
            "",
            "",
            "Make sure this fits",
            "",
            "by entering your model number.",
            "",
            "",
            "Product composition: TPU mobile phone case + glass.",
            "The high-quality TPU material is soft and elastic, which slows down the impact of accidental sliding of the phone.",
            "According to the iPhone 11 mobile phone case, it fits the phone accurately and is not loose.",
            "Although this phone case is very light, it can protect your phone from external forces.",
            "The young and stylish mobile phone shell pattern allows you to show your personal charm when you go out."
        ],
        "reviews": [],
        "brand": "ACHT",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/611M2-UCFtL._AC_SL1200_.jpg"
        ],
        "website": "Amazon",
        "url": "https://www.amazon.com/iPhone11-Protective-Anti-Scratch-Shock-Absorption-I-Phone/dp/B085428R5L/ref=sr_1_32?dchild=1&keywords=%22iphone11%22&qid=1587656435&sr=8-32"
    }
]
